# -*- eval: (add-hook 'after-save-hook 'org-babel-tangle nil t); org-latex-default-figure-position: H; -*-
#+TITLE: تمرین کلاسی فصل چهار
#+AUTHOR: @@latex:\rl{@@محمدیاسین داوده@@latex:}@@
#+PROPERTY: header-args:sql :engine mysql :exports both :tangle "ch4.sql" :comments link :session sql :database sakila
#+STARTUP: fold
#+LANGUAGE: fa
#+LATEX_HEADER: \usepackage{xepersian}\settextfont{XB Roya}\setlatintextfont{XB Roya}\setmonofont{Iosevka}
#+LATEX_HEADER: \xpretocmd{\verbatim}{\begin{LTR}}{}{} \xapptocmd{\endverbatim}{\end{LTR}}{}{} \xpretocmd{\minted}{\VerbatimEnvironment\begin{LTR}}{}{} \xapptocmd{\endminted}{\end{LTR}}{}{}
#+LATEX_HEADER: \xpretocmd{\tabular}{\begin{latin}}{}{} \xapptocmd{\endtabular}{\end{latin}}{}{}
#+LATEX_HEADER: \SetupFloatingEnvironment{listing}{name=کد}
#+MACRO: lr @@latex:\lr{@@​$1​@@latex:}@@
#+MACRO: lt @@latex:\lr{@@​~$1~​@@latex:}@@
#+MACRO: filename (eval (concat "[[file:" (file-name-sans-extension (buffer-name)) $1 "]]"))

* جزئیات و توضیحات

این برگه به شامل کوئری‌های کتاب و تمارین فصل چهار می‌باشد.[fn:orgnote:این فایل خروجی اتوماتیک فایل {{{filename(.org)}}} است. برای اجرای تعاملی کدها فایل را باز کرده هر بخش آنرا ویرایش کنید یا از کدها خروجی گرفته آنها را به یک فایل واحد قابل اجرا تبدیل کنید. فایل ~.org~ فایلی متنی است که با اورگ-مد ایمکس باز می‌شود.]

#+CAPTION: انتخاب پایگاه داده پیش از آغاز
#+begin_src sql :results none :exports code
USE sakila;
#+end_src

* تمرین‌ها

#+CAPTION: تمرین ۱: اعمال فیلتر 
#+begin_src sql
SELECT DISTINCT payment_id
  FROM payment
 WHERE customer_id <> 5
   AND (amount > 8 OR date(payment_date) = '2005-08-23')
 LIMIT 5;
#+end_src

#+RESULTS:
| payment_id |
|------------|
|          5 |
|         44 |
|         59 |
|         62 |
|         69 |

#+CAPTION: تمرین ۲: اعمال فیلتر
#+begin_src sql
SELECT DISTINCT payment_id
  FROM payment
 WHERE customer_id = 5
   AND NOT (amount > 6 OR date(payment_date) = '2005-06-19')
 LIMIT 5;
#+end_src

#+RESULTS:
| payment_id |
|------------|
|        108 |
|        110 |
|        111 |
|        112 |
|        113 |

#+CAPTION: تمرین ۳: کوئری که سطرهایی از جدول را بیاورد که در آن قیمت $1.98$, $7.98$ یا $9.98$ است.
#+begin_src sql
SELECT amount
  FROM payment
 WHERE amount IN (1.98, 7.98, 9.98)
 LIMIT 20;
#+END_SRC

#+RESULTS:
| amount |
|--------|
|   7.98 |
|   9.98 |
|   1.98 |
|   7.98 |
|   7.98 |
|   7.98 |
|   7.98 |

#+CAPTION: تمرین ۴: کوئری که تمام مشتری‌هایی که نام خانوادگی آنها شامل A در جایگاه دوم و یک W بعد از آن در هر جایی باشد.
#+begin_src sql
SELECT last_name
  FROM customer
 WHERE last_name LIKE '_A%W%';
#+END_SRC

#+RESULTS:
| last_name  |
|------------|
| CALDWELL   |
| FARNSWORTH |
| HAWKINS    |
| HAWKS      |
| LAWRENCE   |
| LAWSON     |
| LAWTON     |
| MARLOW     |
| MATTHEWS   |

* کوئری‌های کتاب

#+CAPTION: صفحه ۱۳۳
#+begin_src sql
SELECT c.email
  FROM customer c
 INNER JOIN rental r
    ON c.customer_id = r.customer_id
 WHERE date(r.rental_date) = '2005-06-14'
#+end_src

#+RESULTS:
| email                                 |
|---------------------------------------|
| CATHERINE.CAMPBELL@sakilacustomer.org |
| JOYCE.EDWARDS@sakilacustomer.org      |
| AMBER.DIXON@sakilacustomer.org        |
| JEANETTE.GREENE@sakilacustomer.org    |
| MINNIE.ROMERO@sakilacustomer.org      |
| GWENDOLYN.MAY@sakilacustomer.org      |
| SONIA.GREGORY@sakilacustomer.org      |
| MIRIAM.MCKINNEY@sakilacustomer.org    |
| CHARLES.KOWALSKI@sakilacustomer.org   |
| DANIEL.CABRAL@sakilacustomer.org      |
| MATTHEW.MAHAN@sakilacustomer.org      |
| JEFFERY.PINSON@sakilacustomer.org     |
| HERMAN.DEVORE@sakilacustomer.org      |
| ELMER.NOE@sakilacustomer.org          |
| TERRANCE.ROUSH@sakilacustomer.org     |
| TERRENCE.GUNDERSON@sakilacustomer.org |

#+CAPTION: صفحه ۱۳۴
#+begin_src sql
SELECT DISTINCT c.email
  FROM customer c
 INNER JOIN rental r
    ON c.customer_id = r.customer_id
 WHERE date(r.rental_date) <> '2005-06-14'
 LIMIT 5;
#+end_src

#+RESULTS:
| email                               |
|-------------------------------------|
| MARY.SMITH@sakilacustomer.org       |
| PATRICIA.JOHNSON@sakilacustomer.org |
| LINDA.WILLIAMS@sakilacustomer.org   |
| BARBARA.JONES@sakilacustomer.org    |
| ELIZABETH.BROWN@sakilacustomer.org  |

#+CAPTION: صفحه ۱۳۵
#+begin_src sql :exports code :tangle no :results none
DELETE
  FROM rental
 WHERE year(rental_date) = 2004
 LIMIT 1;
#+end_src

#+CAPTION: صفحه ۱۳۶
#+begin_src sql
SELECT customer_id,
       rental_date
  FROM rental
 WHERE rental_date < '2005-05-25';
#+end_src

#+RESULTS:
| customer_id | rental_date         |
|-------------+---------------------|
|         130 | 2005-05-24 22:53:30 |
|         459 | 2005-05-24 22:54:33 |
|         408 | 2005-05-24 23:03:39 |
|         333 | 2005-05-24 23:04:41 |
|         222 | 2005-05-24 23:05:21 |
|         549 | 2005-05-24 23:08:07 |
|         269 | 2005-05-24 23:11:53 |
|         239 | 2005-05-24 23:31:46 |

#+CAPTION: صفحه ۱۳۷
#+begin_src sql
SELECT customer_id,
       rental_date
  FROM rental
 WHERE rental_date BETWEEN '2005-06-14' AND '2005-06-16'
 LIMIT 5;
#+end_src

#+RESULTS:
| customer_id | rental_date         |
|-------------+---------------------|
|         416 | 2005-06-14 22:53:33 |
|         516 | 2005-06-14 22:55:13 |
|         239 | 2005-06-14 23:00:34 |
|         285 | 2005-06-14 23:07:08 |
|         310 | 2005-06-14 23:09:38 |

#+CAPTION: صفحه ۱۴۰
#+begin_src sql
SELECT last_name,
       first_name
  FROM customer
 WHERE last_name BETWEEN 'FA' AND 'FRB';
#+end_src

#+RESULTS:
| last_name  | first_name |
|------------+------------|
| FARNSWORTH | JOHN       |
| FENNELL    | ALEXANDER  |
| FERGUSON   | BERTHA     |
| FERNANDEZ  | MELINDA    |
| FIELDS     | VICKI      |
| FISHER     | CINDY      |
| FLEMING    | MYRTLE     |
| FLETCHER   | MAE        |
| FLORES     | JULIA      |
| FORD       | CRYSTAL    |
| FORMAN     | MICHEAL    |
| FORSYTHE   | ENRIQUE    |
| FORTIER    | RAUL       |
| FORTNER    | HOWARD     |
| FOSTER     | PHYLLIS    |
| FOUST      | JACK       |
| FOWLER     | JO         |
| FOX        | HOLLY      |
| FRALEY     | JUAN       |
| FRANCISCO  | JOEL       |
| FRANKLIN   | BETH       |
| FRAZIER    | GLENDA     |

#+CAPTION: صفحه ۱۴۳
#+begin_src sql
SELECT title,
       rating
  FROM film
 WHERE rating IN (
        SELECT rating
          FROM film
         WHERE title LIKE '%PET%'
       )
 LIMIT 5;
#+end_src

 #+RESULTS:
 | title            | rating |
 |------------------+--------|
 | ACADEMY DINOSAUR | PG     |
 | ACE GOLDFINGER   | G      |
 | AFFAIR PREJUDICE | G      |
 | AFRICAN EGG      | G      |
 | AGENT TRUMAN     | PG     |

 شامل وایلدکارت‌ها نیست (کامل شود).
